<?php
	// строки, работа со строками.
	// Различают 4 способа написания строк:
	// '' - одинарные кавычки
	// "" - двойные кавычки
	// HEREDOC - синтаксис
	// NOWDOC - синтаксис

	// одинарные кавычки могут иметь только текст.
	$odKavich = 'Опа гагнамстайл';
	// можно так же в одинарных кавычках написать одинарную кавычку, но ее нужно экранировать
	$odKavich = '\'Оп оп\' гагнамстайл';
	// в одинарных кавычках не работают escape последовательности(такие как \n - перевод строки)
	// так же невозможно поместить переменную в одинарные ковычки
	// и не будут работать так же теги html в одинарных тегах

	// двойные кавычки тоже могут иметь текст, так же в них можно встраивать переменные, escape-последовательности работают
	
	// так же можно обычные одинарные кавычки писать как обычно, а двойные придется экранировать, чтобы вставить переменную в строку, нужно ее обернуть в {}
	$dvKavich = "\"'Опа', чекай че могу! {$odKavich}\"<br>";
	echo $dvKavich;
	//так же можно встраивать теги html

	// HEREDOC синтаксис может в себе так же всктраивать переменные, и может переходить на другие строки
	// мы пишем <<< и потом индетификатор, которым мы открываем и будем закрывать HEREDOC строку.
	// heredoc может писать теги и переменные.
	// нужно быть адекватным с HEREDOC синтаксисом, после написания индетификатора мы должны сразу переносится на другую строку

	$herdSyntax = <<<DOC
	<br> Капетс, чекай! <br>
	$dvKavich
	Да, я могу хранить так же как переменные и теги
	DOC;
	echo $herdSyntax;

	//NOWDOC синтаксис такой же, только как одинарки не может в себе хранить переменные, теги и т.д
	// пишется он так же как и хередок, только вот первый индетификатор будет в кавычках, а закрывающий индетификатор без.

	$nowdSyntax = <<<'DOC'
	БЛИИН КАЙФ ЭТО МНЕ ДОСТАВЛЯЕТ УДОВОЛЬСТВИЕ
	DOC;
	echo $nowdSyntax;