<?php	
	// Типы данных
	/* 
	В информатике есть различия между данными, допустим, строки, числа, числа с точкой, это все разные значения, точнее разные типы
	Да, число 3 и число 3.4 это вообще разные типы.
	И собственно, PHP язык со слабой типизатсией. Да, в PHP есть типы данных, и они вот такие:
	Скалярные типы: 
	int - тселое число(3)
	float - число с плавающей точкой(3.14)
	string - Строка("3", '3')
	bool - булева(о них позже, true, false)
	составные типы:
	array - массивы
	object - объекты
	Спетсиальные типы:
	null - спетсиальный тип данных, который задается переменной/константе если в ней ничего не лежит(не инитсиализирована)
	resources - ресурсы

	Программист может создавать свои типы данных
	*/

	// Мы будем юзать var_dump() и print_r() который позволяет нам легко работать с типами
	// хотим узнать какого типа переменная?
	$var = 3458;
	var_dump($var);
	// var_dump нам показывает тип и значение переменной
	//print_r() помогает работать с массивами, но об этом позже.

	// Так как php создавался для веба, то он слабо типизированный, да в нем есть типы и это убирает много ошибок, но он слаботипизированный
	// это значит что вы строку не умножите на строку, но если мы допустим 7 + '7' сложим, то получим 14
	echo 6 + '16';
	// это происходит потому, потому что PHP иногда думает что сделать, преобразовать строку в число или нет, и когда он видит только числа, он преобразует это в выражение
	
	// он так же может так же и посчитать значение, но тут уже будет предупреждение.
	echo 6 * '13 + 34 - 4';
	// казалось бы, зачем такое делать? и это легко объясняется.
	// все что мы пишем - строка, пишем допустим номер телефона в регистратсии вконтакте? так это будет строка, не число, или пишем ответ на математический ответ где нибудь тоже строка
	// и php все сам преобразует в число если посчитает нужным, но иногда могут быть ошибки, и сдесь мы уже можем контроллировать типы
	// да, мы можем изменять тип вот так:
	// 50 превращается в строку
	echo (string) 50;
	// как это работает? мы в скобках возле значения(впереди) указываем тип, и этот значение преобразуется в определенный тип.

	// а это как работает? 
	echo (string) (5 + (int) '9');

	// легко и просто! сдесь мы 5 складываем с 9, но девять при этом превращается в число, после того, как все мат оператсии сделаны, мы число превращаем в строку с помощью (string)
	// потому что она впереди, да, вот так просто.