<?php
	// if else
	/* 
		наверное самая популярная конструктсия в языка
		и так, работает оно вот так:
		если (выражение) код;
		если выражение верно, т.е true( например 3 > 2 ) то тогда код выполняется
		а если неверно, т.е false(например 3 < 2) то тогда код не выполнится, и выглядеть это будет вот так:
	*/


	// верно
	if (3 > 2) echo "3 больше 2<br>";
	// неверно
	if (3 < 2) echo "3 меньше 2<br>";
	/* 
	как мы видим, вывелось первое, потому что 3 всегда больше 2, так что условие верно.
	так же иногда условие называется предикатом	
	т.е если предикат верен, то код далее в if будет выполнятся, а если нет, то не будет выполнятся

	а если нам нужно сделать условие, в котором нужно выполнить много кода? не вопрос!
	нужно просто после if написать {} и в них писать код весь который выполнится при верном предикате
	выглдяти это так:
	*/

	if (3 == 3) {
		echo "3 равен 3<br>";
		echo "еще какой то код...";
	}

	/* 
	а если нам нужно сразу несколько условий проверить? не вопрос!
	юзаем or, and, ||, && вот так:
	*/

	$role = "admin";
	$password = "123";
	// если $role равен "admin" и $password = "123" верны, то выполняется echo
	if($role == "admin" && $password = "123") {
		echo "Вы вошли в аккаунт!<br>";
	}

	// а что есть не true и что есть не false? почти всегда if все неявно приводит к булину
	/* вот что будет true всегда:
	строка, в которой есть буквы, тсифры(исключение "0")
	тсифры, кроме нуля(-1 тоже является true)
	всякие логические выражения, по типу (3>2, 3==3)
	а вот что будет false сегда:
	пустая строка
	строка где внутри только ноль("0")
	и так же тсифра 0
	*/
	

	// кстати
	$num = 3;
	
	if ($num) echo "привет<Br>";
	// как видишь, вывелось, а почему? а потому что if видит 3 и приводит его к булину и получается true

	// кстати, есть так же else, ему не нужно предикат(условие), он выполняется в том случае, если if не смог выполнится
	// пишется он только с if, если if можно писать и без else, то else всегда вместе с if пишется 
	// вот так оно пишется:

	if (3 > 4) {
		echo "ОШИБКА<br>";
	} else {
		echo "как видишь, я выполнился, потому что предикат был неверен, и я выполнился потому что if невыполнился.";
	}

	// так же есть else if, если мы хотим проверять не только одно условие
	// работает как if, но вот только пишется после if

	if (3 > 4) {
		echo "ахах";
	} else if (3 < 4) {
		echo "как видишь, я вывелся потому что мой предикат верен<br>";
	} else {
		echo "чооо";
	}

	// вообще если else if очень много в конструктсии if то лучше использовать свитч, который будет потом далее в уроках, но пока что можно юзать именно elseif
	// да, так как код идет построчно, сверху вниз, то сначало проходит проверку if, если проверка не верно(Предикат false) то тогда идет далее
	// если же в коде находится верное условие, то if конструктсия сразу пропускается и идет далее код.
	// т.е если верное условие найдено и код выполнился, то код не идет дальше и не проверяет другие elseif, else а сразу пропускается