<!DOCTYPE html>
<html lang="ru">
<meta charset="UTF-8">
<title>Программирование на языке PHP</title>
<body>
	
	<h1>Введение в PHP</h1>
	<hr>
	<h2>Все будет правильно, на этом построен мир</h2>
	
	<?php

        // ЗАДАЧА: СОЗДАТЬ ПЕРЕМЕННЫЕ В КОТОРЫХ ПОМЕСТИТЬ СТРОКИ И ЭТИ ПЕРЕМЕННЫЕ ВЫЗВАТЬ ПОТОМ
		// создаем переменные
		$firstDialoge = "Дав арестованному договорить, Пилат изменил свой первоначальный замысел   и решил не  спорить с ним,  а закончить  допрос. Он сказал:<p>
		- <b>Так ты утверждаешь, что не призывал разрушить... или поджечь, или каким–либо иным способом уничтожить храм?</b> <p>";
        // строки тоже выражения
		$SecondDialoge =  "- <b>Я, игемон, никогда не призывал к подобным действиям, повторяю.</b> <p>";
		
		$threeDialoge = "- <b>Так поклянись своей жизнью, что этого не было,</b> - сказал прокуратор и улыбнулся какой–то страшной улыбкой. – <b>Ею клясться самое время, так 
		как она висит на волоске, помни это.</b><p>";
		
		$fourthDialoge = "- <b>Не думаешь ли ты, что ты ее подвесил, игемон?</b> – спросил арестант. – <b>Если это так, то ты сильно ошибаешься.</b><p>";
		
		$fiveDialoge = "Пилат вздрогнул и ответил сквозь зубы:<p> - <b>Но я легко могу перерезать этот волосок.</b><p>";
		
		$SixDialoge =  "- <b>И в этом ты ошибаешься,</b> - светло улыбаясь,  возразил арестант, - <b>согласись, что перерезать волосок  уж наверно может лишь тот, 
		кто подвесил?</b><p>";
		
		$SevenDialoge =  "- <b>Так, так</b> – улыбнувшись, сказал Пилат, - <b>теперь я не сомневаюсь, что праздные зеваки в Ершалаиме ходили за тобой по пятам.</b> После этих
		слов у него, уже в светлой голове, отчетливо сложилась формула приговора.  И он ее тут же  озвучил для записи в протокол:  игемон разобрал дело бродячего 
		философа Иешуа  и состава преступления в нем не нашел.<p>";
	
    ?>

    <?php
    // вывод переменных
    echo $firstDialoge;
    echo $SecondDialoge;
    echo $threeDialoge;
    echo $fourthDialoge;
    echo $fiveDialoge;
    echo $SixDialoge;
    echo $SevenDialoge;
    ?>
	
</body>
</html>