<?php
	// про что я забыл, так это про тернарный оператор. Согласитесь, иногда в зависимости от предиката(Условия) нужно переменной присвоить опеределенное значение
	// допустим превращать ли мне в модуль число или нет

	$num = -3;
	
	if ($num > 0) {
		$modul = $num;
	} else {
		$modul = -$num;
	}
	echo "Модуль числа: $modul.<br>";

	// согласитесь, очень огромный код для превращения числа в модуль, и люди придумали тернарный оператор
	// состоит он из ?, :
	// и выглядит вот так:
	$num = -345;
	$modul = ($num > 0) ? $modul = $num : -$num;
	echo "Модуль числа: $modul.<br>";

	// как это понимать? первым идет условие, а именно ($num > 0)
	// потом после ? мы указываем код, который будет выполнятся если предикат верен
	// после : идет код, который выполнится если предикат НЕ верен
	// получается то, что это конструктсия if else только записывается в переменную, вот это да!