<?php 
    /* 
    КОНСТАНТЫ ЭТО ТАКИЕ ПЕРЕМЕННЫЕ, КОТОРЫЕ НЕ МОГУТ УДАЛЯТСЯ И НЕ МОГУТ ИЗМЕНЯТСЯ
    СОЗДАЮТСЯ ОНИ С ПОМОЩЬЮ КЛЮЧЕВОГО СЛОВА const ИЛИ С ПОМОЩЬЮ ФУНКТСИИ define()
    синтаксис:
    
    достаточно просто записать const и написать имя константы а потом присвоить ей выражение любое
    const ИМЯКОНСТАНТЫ = 35;

    либо же написать define() где первый аргумент в кавычках будет имя константы, а потом через запятую другой аргумент будет выражением
    define("ИМЯКОНСТАНТЫ", 35);    

    константы могут иметь в значении скалярные выражения, массивы состоящие из скалярных выражений(следующий урок)
    константы именуются БОЛЬШИМИ БУКВАМИ, Т.Е ТОЛЬКО БОЛЬШИМИ БУКВАМИ.
    */

    // создаем константу по ключевому слову const
    const NAME = "Yaroslav";

    // создаем константу по функтсии define
    define("SURNAME", "Shevchenko");

    echo NAME;
    echo ' ';
    echo SURNAME;

    // можно создавать константы массивы.
    // так же делать и с define
    const NAMEARRAY = ["Yaroslav", "Shevchenko", "Grigoryevich"];

    // сдесь уже придется юзать array()
    define("NAMEARR", array("Yaroslav", "Shevchenko"));

    echo "<br>" . NAMEARRAY[0] . ' ' . NAMEARRAY[1];
    echo "<br>" . NAMEARR[0] . ' ' . NAMEARR[1];
    // О МАССИВАХ БУДЕТ ИДТИ РЕЧЬ ТОЛЬКО ПОСЛЕЗАВТРА, Я ЛИШЬ ПОКАЗАЛ ЧТО ТАКОЕ ЕСТЬ