<?php
	// функтсии - замечательная вещь, раньше с помощью них строились все программы(вплне, состояли из них)
	// сейчас же появилось ООП(об этом в другой раз)
	// но функтсии до сих пор пользуются и очень часто
	// функтсии это как набор кода, который можно использовать несколько раз
	// так же у функтсий есть аргументы, которые могут использоватся в одном участке кода, вместо аргументов ставится значение, которое используется в участке кода
	// указываются аргументы в скобках.
	// а вот как вызвать функтсию: имяФунктсии(арг1, арг2, ... аргN);
	// функтсия может и без аргументов: имяФунк();

	//функтсия echo допустим с аргументами:
	echo "arg<br>";

	// а теперь поговорим о функтсиях, которые нам помогут в будущем
	// поговорим о isset
	// isset - проверяет переменную на то, что она существует или не имеет значение null
	// если переменная существует и не имеет значение null, то вернет true, в ином случае false
	$var = null;
	if (isset($var)) {
		echo "$var<br>";
	} else if (!isset($var)) {
		echo "\$var = null<br>";
	}
	// как мы видим, $var как бы былo, но значение былo null
	// а теперь проверим несущ переменную:

	if(!isset($var)) echo "переменной не существует<br>"; else echo "переменная существует<br>";
	// но согласитесь, писать !isset не особо круто, точнее не особо круто писать !(логическое НЕ)
	// придумали для этого empty, который проверяет, несуществует ли переменная или не имеет ли значение null/false
	// если переменная не существует или имеет значение null/false вернет true, в ином случае false

	// так же можно удалить переменную, вот так:
	unset($var);
	// поставил @ для того, чтобы ошибка не высвечивалась
	echo @"$var";
	// ошибка высветится, т.к переменной $var несуществует

	// есть функтсия rand, которая может сгенерировать рандомное число от нуля до максимально большого числа в php, если аргументов не существует:
	echo rand() . "<br>";
	// можно указать первое число, которая будет означать минимальное число, а второй аргумент будет значать максимальное число:
	echo rand(32, 64) . "<br>";
	// можно так же указать переменные как аргументы:
	$min = 30;
	$max = 50;
	$random = rand($min, $max);
	echo "$random.<br>";
	// есть так же функтсия для узнавания квадратного корня:
	echo sqrt(16) . "<br>"; // 4
	// такие же правила, 1 аргумент, можно переменные указывать как аргументы
	// так же есть функтсия pi(), которая говорит число пи
	echo pi() . ".<br>";