<?php
	// Более теоретический урок про массивы
	//Чаще всего, массивы разрастаются до небес, допустим у нас есть полководетс, его битвы и т.д
	$generals = [
		"Наполеон" => [
			"Имя" => "Наполеон Бонапарт",
			"Место рождения" => "Корсика",
			"Битвы" => [
				"Битва при ваттерло" => [
					"Дата" => "18 июня 1815",
					"Место действий" => "Нидерланды, Ватерлоо",
					"Итог" => "Крупное поражение Наполеона"
				]
			]
		]
	];
	// уже даже так видно, как разросся массив, у нас был массив $generals, потом Наполеон, разросся до битв, потом разросся до ватерлоо, много, очень много!
	// попробуем вывести итог:
	echo "Итог: {$generals["Наполеон"]["Битвы"]["Битва при ваттерло"]["Итог"]}<br>";
	// четырехмерный массив... спагетти код? и тут мы подходим к базам данных, да, человеку присуще все облегчать
	// и люди придумали для баз данных очень хорошую систему таблитс - матритсу
	// это где мы строим таблитсу, ну кароче, загуглите)
	// так вот, там бывает так, чтобы избежать огромных таблитс, создают связанные таблитсы, почему бы нам бы не изменить базу данных?
	$generalsBase = [
		"Наполеон" => [
			"id" => 1
		],
		"Пригожин" => [
			"id" => 2
		]
	];
	$infoGenerals = [
		"id1" => [
			"Имя" => "Наполеон Бонапарт",
			"Место рождения" => "Корсика",
			"Битвы" => [
				"id1b" => "Битва при Ватерлоо",
				"id2b" => "Великая отечественная война"
			]
		],
		"id2" => [
			"Имя" => "Евгений Пригожин",
			"Место рождения" => "Ленинград",
			"Битвы" => [
				"id1b" => "Битва в бахмуте"
			]
		]
	];
	$infoBattles = [
		// айди добавлены для понимания кода
		"Наполеон" => "id1",
		"Пригожин" => "id2",
		"id1" => [
			"Битва под Ватерлоо" => [
				"Дата" => "18 июня 1815",
					"Место действий" => "Нидерланды, Ватерлоо",
					"Итог" => "Крупное поражение Наполеона"
			]
		]
	];

	// вот так мы и смогли разобрать один большой непонятный массив в несколько мелких, которые связаны между собой!
	// выведем итог битвы под ватерлоо
	echo "Итог: {$infoBattles["id1"]["Битва под Ватерлоо"]["Итог"]}";
	// в два раза меньше написание кода! понятное дело, что можно и лучше все сделать, но ладно