<?php 
    // вот так создается переменная, нужно написать $ потом имя переменной, так PHP поймет, что это переменная
    // переменным не нужно указывать тип данных(вернемся к этом в 3 уроке)
    // переменная может хранить строки, числа, и т.д
    // переменная создается при первом упоминании в программе
    // если допустим написать где нибудь в программе echo $var, при этом до этого $var не было, то переменная создатся
    $variable = 30;
    // значения переменных можно выводить на экран:
    echo $variable;

    // переменной присваивается выражение, которое стоит справа. Т.е 59 + 30 это выражение, которое будет положено в $variable, и $variable будет хранить это выражение
    // так же в переменной можно делать всякие математические действия
    $variable = 59 + 30;
    $var1 = 34;
    // переменные можно использовать в переменных.
    $variable = $var1 - 30;

    // переменные называтся могут по разному, но они не должны начинатся с тсифр и не должны начинатся с спетс символов(%)
    // и наименоватся они должны по правилам camelCase
    //Вот так:
    // 100 это тоже выражение, т.е 300, 49 - 3, 39 * 39, 3 это все выражения.
    $rublesInDollar = 100;
    echo $rublesInDollar;

    // так же переменные могут иметь магические числа, лучше определенные числа, которые часто используются в программе выводить в переменные, чтобы было понятно где-что
    $villagers = 3 * 30;
    // согласись, непонятно, что такое 3 и 30? проще создать для них переменные
    $villagersInHouse = 3;
    $housesInVillage = 30;
    // теперь понятно!
    $villagers = $villagersInHouse * $housesInVillage;