<?php
	// иногда некоторые файлы нужно подключать в файл
	// у нас есть три файла, и мы хотим из одного файла взять функтсии их использовать во втором
	// мы подключаем файл один через функтсию include

	// дело в том, что если пдключить include то не будет фатальной ошибки, код выполнения продолжится
	include "file.php";
	// вызовем функтсию из файла:
	func("Привет привет!");
	// мы эту функтсию создали в file.php! и можем использовать сдесь!
	// но мы можем использовать еще раз include!
	include "file.php";
	// хотелось бы чтобы была фатальная ошибка если файл не найдется, и приходит require
	require "file2.php";
	// если файл не был найден, то ошибка будет 100% и сайт не заработает
	ech("Привет!!!");

	// но мы можем нечайно пару раз подключить один и тот же файл.
	// и пришли include_once, require_once, которые если второй раз подключить, то будет ошибка

	include_once "file3.php";
	include_once "file3.php";

	// есть конструктсия switch, которая проверяет на определенные значения, переменную которая будет в скобках
	$x = 3;
	switch ($x) {
		case 1:
			ech("1");
			break;
		case 2:
			ech("2");
			break;
		case 3:
		case 4:
		case 5:
		case 6:
			ech("В диапозоне 3-6");
			break;
		default:
		ech("не угадал");
	}
	// рабоает вот так: case (число на которое проверяем): действия; break;
	// если число на которое проверям совпадает со значением переменной, то выполняется данный кейс
	// действия будут рабоать если кейс верен, break заканчивает кейс
	// с примером case 3 ... case 6 видно, что можно сразу несколько кейсов указать 
	// и если в кейсе от 3 до 6 будет число 3 до 6 в переменной, то выполнится функтс ech("в диапозоне 3-6");
	// default выполняется если ничто не выполнилось, аналог else, может не писатся